In [11]:
import pandas as pd
import numpy as np

In [12]:
x=[5.6, " sana", 'F', 25]
f=pd.DataFrame(x)
f

       0
0    5.6
1   sana
2      F
3     25

In [13]:
x = ['COMSATS', 'FAST', 'NUST', 'ISLAMIC']
y = pd.DataFrame(x)       
y

         0
0  COMSATS
1     FAST
2     NUST
3  ISLAMIC

### if you want to avoid pd

In [14]:
from pandas import DataFrame

In [15]:
# list of strings
x = ['COMSATS', 'FAST', 'NUST', 'ISLAMIC']

# Calling DataFrame constructor on list
y = DataFrame(x)        # we give it name as pd
y

         0
0  COMSATS
1     FAST
2     NUST
3  ISLAMIC

# Creating DataFrames from Dictionary

In [16]:
x={"Name":["Ali","Usman","Somia"], "Age":[25,20,18], "Gender":['Male','Male','Female']}
df=pd.DataFrame(x)
df

    Name  Age  Gender
0    Ali   25    Male
1  Usman   20    Male
2  Somia   18  Female

## Creating Data Frames from arrays

In [17]:
arr=np.array([10,30.5,"Ali"])

In [18]:
print(arr)

['10' '30.5' 'Ali']

In [19]:
df=pd.DataFrame(arr)
df

      0
0    10
1  30.5
2   Ali

## DataFrame: Columns Name

In [32]:
data=pd.DataFrame(arr, columns= ['values'])
data

  values
0     10
1   30.5
2    Ali

### Creating Empty Columns of DataFrame

In [33]:
col=['id','Name']
n=range(0,3)
df=DataFrame(index=n, columns=col)
df

    id Name
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN

In [34]:
x=[(101,'Samiya'), (102,'Ali'), (103,'Rimsha')]
df=DataFrame(x,columns=col)
df

    id    Name
0  101  Samiya
1  102     Ali
2  103  Rimsha

### Another way of creating columns and passing data

In [35]:
data=[(101,'Samiya',50000, 15000), (102,'Ali',25000,5000), (103,'Rimsha',60000,20000)]

x=DataFrame(data, columns=["id","name","Salary","Bonus"])
x

    id    name  Salary  Bonus
0  101  Samiya   50000  15000
1  102     Ali   25000   5000
2  103  Rimsha   60000  20000

# Converting DataFrame to CSV

In [36]:
x=x.to_csv("Basic_pandas_csv.csv" , index=False) # we add index= False to avoid unnamed index

# Reading CSV from Pandas

In [37]:
y=pd.read_csv("Basic_pandas_csv.csv")

In [38]:
y

    id    name  Salary  Bonus
0  101  Samiya   50000  15000
1  102     Ali   25000   5000
2  103  Rimsha   60000  20000

# Displaying First Records from CSV

In [39]:
y.head()

    id    name  Salary  Bonus
0  101  Samiya   50000  15000
1  102     Ali   25000   5000
2  103  Rimsha   60000  20000

# Converting DataFrame into Excel

In [40]:
z=df.to_excel("Basic_pandas_excel.xls" , index=False) # we add index= False to avoid unnamed index

# Displaying Data into Excel

In [41]:
w=pd.read_excel("Basic_pandas_excel.xls")
w.head()

    id    Name
0  101  Samiya
1  102     Ali
2  103  Rimsha

# Accessing dataset in DataFrame

In [42]:
for key, values in iris.iteritems():
    print(key, values[1])

sepal.length 4.9
sepal.width 3.0
petal.length 1.4
petal.width 0.2
class Setosa

In [48]:
iris=pd.read_csv("iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width      class
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [44]:
iris.drop('petal.width', axis=1 , inplace=True)
iris.head()

   sepal.length  sepal.width  petal.length   class
0           5.1          3.5           1.4  Setosa
1           4.9          3.0           1.4  Setosa
2           4.7          3.2           1.3  Setosa
3           4.6          3.1           1.5  Setosa
4           5.0          3.6           1.4  Setosa

In [45]:
iris.drop(iris.index[2:6], inplace=True)

In [46]:
iris.head()

   sepal.length  sepal.width  petal.length   class
0           5.1          3.5           1.4  Setosa
1           4.9          3.0           1.4  Setosa
6           4.6          3.4           1.4  Setosa
7           5.0          3.4           1.5  Setosa
8           4.4          2.9           1.4  Setosa

In [47]:
iris.to_csv("iris_new.csv" , index=False) # we add index= False to avoid unnamed index

In [116]:
pd.read_csv("iris_new.csv")

     sepal.length  sepal.width  petal.length    variety
0             5.1          3.5           1.4     Setosa
1             4.9          3.0           1.4     Setosa
2             5.4          3.7           1.5     Setosa
3             4.8          3.4           1.6     Setosa
4             4.8          3.0           1.4     Setosa
..            ...          ...           ...        ...
137           6.7          3.0           5.2  Virginica
138           6.3          2.5           5.0  Virginica
139           6.5          3.0           5.2  Virginica
140           6.2          3.4           5.4  Virginica
141           5.9          3.0           5.1  Virginica

[142 rows x 4 columns]